init.el
;;; -*- lexical-binding: t -*-

(defun tangle-init ()
  "If the current buffer is init.org the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
		 (expand-file-name
		  (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil))
	(org-babel-tangle)
	(byte-compile-file (concat user-emacs-directory "init.el")))))

(add-hook 'after-save-hook 'tangle-init)

(defvar personal-keybindings '())

(setq gc-cons-percentage 0.6)
(setq gc-cons-threshold (* 50 1000 1000))

;; Set and reset threshold
(let ((old-gc-treshold gc-cons-threshold))
  (setq gc-cons-threshold most-positive-fixnum)
  (add-hook 'after-init-hook
	    (lambda () (setq gc-cons-threshold old-gc-treshold))))

;; native-comp warning
(setq native-comp-async-report-warnings-errors 'silent)
(setq byte-compile-warnings
      '(not free-vars unresolved noruntime lexical make-local))

(setq idle-update-delay 1.0)

(setq process-adaptive-read-buffering nil)
(setq read-process-output-max (* 4 1024 1024))

(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")

(require 'package)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package)
  (eval-when-compile
    (unless (bound-and-true-p package--initialized)
      ;; be sure load-path includes package directories
      (when (< emacs-major-version 27)
	(package-initialize)))
    (require 'use-package)))

(require 'use-package-ensure)
(setq use-package-always-ensure t)

(setq package-archives
      '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
	("MELPA"        . "https://melpa.org/packages/")
	("ORG"          . "https://orgmode.org/elpa/")
	("MELPA Stable" . "https://stable.melpa.org/packages/")
	("nongnu"       . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("GNU ELPA"     . 20)
	("MELPA"        . 15)
	("ORG"          . 10)
	("MELPA Stable" . 5)
	("nongnu"       . 0)))
(package-initialize)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
	"straight/repos/straight.el/bootstrap.el"
	(or (bound-and-true-p straight-base-dir)
	    user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://radian-software.github.io/straight.el/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq utf-translate-cjk-mode nil)
(set-language-environment "UTF-8")
(setq locale-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)
(set-selection-coding-system (prefer-coding-system 'utf-8))
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(scroll-bar-mode -1)
(menu-bar-mode 0)
(tool-bar-mode 0)
(display-time-mode 1)
(display-battery-mode 1)

(setq ring-bell-function 'ignore)
(setq truncate-lines t)
(setq frame-resize-pixelwise t)

(fset 'yes-or-no-p 'y-or-n-p)

(defun custom/kill-this-buffer ()
  (interactive) (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k")
		   'kill-buffer-and-window)

(global-set-key (kbd "C-c k")
		   'kill-buffer)

(defun config-visit()
  (interactive)
  (find-file "~/.emacs.d/init.org"))
(global-set-key (kbd "C-c e") 'config-visit)

(put 'dired-find-alternate-file 'disabled nil)

(setq backup-by-copying t
      backup-directory-alist '(("." . "~/.saves/"))
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2)

(setq frame-title-format "%b")

(defvar custom-bindings-map (make-keymap)
  "A keymap for custom keybindings.")

(use-package doom-themes
  :ensure t
  :config
  (load-theme 'doom-one t)
  (doom-themes-org-config))

;; set a default font
(when (member "Fira Code" (font-family-list))
  (set-face-attribute 'default nil
		      :font "Fira Code"
		      :height 160))

(when (member "Iosevka Fixed Curly" (font-family-list))
  (set-face-attribute 'default nil
		      :font "Iosevka Fixed Curly"
		      :height 160))

(when (member "Iosevka Comfy" (font-family-list))
  (set-face-attribute 'default nil
		      :font "Iosevka Comfy"
		      :height 160))

(use-package all-the-icons-dired
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode))

(global-prettify-symbols-mode 1)
(defun add-pretty-lambda ()
  (setq prettify-symbols-alist
	   '(
	     ("[ ]" . 9744)
	     ("[X]" . 9745)
	     ("lambda" . 955)
	     ("epsilon" . 603)
	     ("->" . 8594)
	     ("<-" . 8592)
	     (":-" . 8592)
	     ("!sum" . 8721)
	     ("<=" . 8804)
	     (">=" . 8805)
	     ("=>" . 8658)
	     ("#+BEGIN_SRC"     . 955)
	     ("#+END_SRC"       . 955)
	     ("#+begin_src"     . 955)
	     ("#+end_src"       . 955))))
(add-hook 'prog-mode-hook 'add-pretty-lambda)
(add-hook 'org-mode-hook 'add-pretty-lambda)

(use-package olivetti
  :defer t
  :bind (:map custom-bindings-map ("C-c o" . olivetti-mode))
  :config
  (setq olivetti-style t))

(use-package writeroom-mode
  :bind (:map custom-bindings-map ("<f1>" . writeroom-mode))
  :defer t)

(setq inhibit-startup-screen t)

;; https://www.youtube.com/watch?v=NfjsLmya1PI
(setq initial-scratch-message 
      ";; Present Day, Present Time...\n")

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-set-navigator t)
  (setq dashboard-center-content t)
  (setq dashboard-banner-logo-title "G A F A N H O T O")
  (setq dashboard-startup-banner "~/.emacs.d/grasshopper.png")
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))))

(use-package dired
  :ensure nil
  :hook
  (dired-mode . dired-hide-details-mode))
