init.org
** Subtree to dired
#+BEGIN_SRC emacs-lisp
  (use-package dired-subtree
    :ensure t
    :config
    (setq dired-subtree-use-backgrounds nil)
    (define-key dired-mode-map [tab] 'dired-subtree-toggle))
#+END_SRC

* Completion
** Vertico as completion UI
#+begin_src emacs-lisp
  (use-package vertico
    :config
    (vertico-mode 1)
	  ; Show more candidates
    (setq vertico-count                         25
	  read-extended-command-predicate
	  'command-completion-default-include-p
	  ; Ignore case of file names
	  read-file-name-completion-ignore-case t
	  ; Ignore case in buffer completion
	  read-buffer-completion-ignore-case    t
	  ; Ignore case in completion
	  completion-ignore-case                t))
#+end_src

#+begin_src emacs-lisp
  (use-package vertico-posframe
    :config
    (vertico-posframe-mode 1)
    (setq vertico-posframe-width  90
	  vertico-posframe-height vertico-count))
#+end_src

** Corfu for completion
   #+begin_src emacs-lisp
     (use-package corfu
       :custom
       ;; Enable auto completion
       (corfu-auto t)
       ;; Enable cycling for `corfu-next/previous'
       (corfu-cycle t)
       ;; No delay
       (corfu-auto-delay 0)
       ;; Start when this many characters have been typed
       (corfu-auto-prefix 2)
       ;; Short delay
       (corfu-popupinfo-delay 0.5)
	;; Preselect the prompt
       (corfu-preselect 'prompt)
       :init
       (global-corfu-mode))

     (use-package emacs
       :init
       ;; TAB cycle if there are only few candidates
       ;; (setq completion-cycle-threshold 3)

       ;; Enable indentation+completion using the TAB key.
       ;; `completion-at-point' is often bound to M-TAB.
       (setq tab-always-indent 'complete)

       ;; Emacs 30 and newer: Disable Ispell completion
       ;; function. As an alternative,
       ;; try `cape-dict'.
       (setq text-mode-ispell-word-completion nil)

       ;; Emacs 28 and newer: Hide commands in M-x
       ;; which do not apply to the current
       ;; mode.  Corfu commands are hidden, since
       ;; they are not used via M-x. This
       ;; setting is useful beyond Corfu.
       (setq read-extended-command-predicate
	     #'command-completion-default-include-p))
   #+end_src

** Which key to know what to press
It's helpful to know what key combos are available whenever I'm typing
something!
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :config (which-key-mode))
#+end_src

** Marginalia Annotations
#+begin_src emacs-lisp
  (use-package marginalia
    :init 
    (marginalia-mode 1))
#+end_src

** Better Help with Helpful
#+begin_src emacs-lisp
  (use-package helpful
    :bind (:map custom-bindings-map
			    ("C-h f" . #'helpful-function)
			    ("C-h v" . #'helpful-variable)
			    ("C-h k" . #'helpful-key)
			    ("C-h x" . #'helpful-command)
			    ("C-h d" . #'helpful-at-point)
			    ("C-h c" . #'helpful-callable)))
#+end_src

** Yasnippet
Code snippets to program and other predefined blocks
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))
#+END_SRC
*** All additional snippets
**** Some extras
     #+begin_src emacs-lisp
       (use-package yasnippet-snippets
	 :ensure t)
     #+end_src
**** Haskell
     #+begin_src emacs-lisp
       (use-package haskell-snippets
	 :defer t)
     #+end_src

* Utilities
** PDF Tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :ensure t
    :config
    (pdf-tools-install)
    :custom (pdf-annot-activate-created-annotations
		t "automatically annotate highlights"))
#+END_SRC

** Lorem ipsum
Just some lorem ipsum in your buffer
#+BEGIN_SRC emacs-lisp
  (use-package lorem-ipsum)
#+END_SRC

** Shell
*** vterm
#+begin_src emacs-lisp
  ;; Make sure that cmake, libtool, libtool-bin
  (use-package vterm
    :ensure t
    :config
    (setopt vterm-tramp-shells '(("ssh" "/bin/bash")
				 ("sshx11" "/bin/bash")
				 ("docker" "/bin/sh")))
    )
#+end_src

*** eshell
Eshell is a pretty nice terminal. But it needs some tweaks to make it a little bit more comfortable.
   #+begin_src emacs-lisp
     (setq eshell-prompt-regexp "^[^αλ\n]*[αλ] ")
     (setq eshell-prompt-function
	   (lambda nil
	     (concat
	      (if (string= (eshell/pwd) (getenv "HOME"))
		  (propertize "~" 'face `(:foreground "#99CCFF"))
		(replace-regexp-in-string
		 (getenv "HOME")
		 (propertize "~" 'face `(:foreground "#99CCFF"))
		 (propertize (eshell/pwd) 'face
			     `(:foreground "#99CCFF"))))
	      (if (= (user-uid) 0)
		  (propertize " α " 'face `(:foreground "#FF6666"))
		(propertize " λ " 'face `(:foreground "#A6E22E"))))))

     (setq eshell-highlight-prompt nil)
   #+end_src

   #+begin_src emacs-lisp
     (defalias 'open 'find-file-other-window)
     (defalias 'clean 'eshell/clear-scrollback)
   #+end_src

   #+begin_src emacs-lisp
     (defun eshell-other-window ()
       "Create or visit an eshell buffer."
       (interactive)
       (if (not (get-buffer "*eshell*"))
	   (progn
	     (split-window-sensibly (selected-window))
	     (other-window 1)
	     (eshell))
	 (switch-to-buffer-other-window "*eshell*")))

     (global-set-key (kbd "<C-escape>") 'eshell-other-window)
   #+end_src

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :bind (("C-c m" . magit-status)))
#+end_src

** Markdown mode
#+begin_src emacs-lisp
  (use-package markdown-mode
    :defer t)
#+end_src

* Spelling
I am horrible at natural languages, and since I have to use 
them daily to communicate, I desperately require tools to aid me. Emacs 
has a couple of packages for spelling and syntax.
** Flyspell
#+BEGIN_SRC emacs-lisp
  (use-package flyspell
    :ensure t
    :config
    (add-hook 'text-mode-hook 'flyspell-mode))
#+END_SRC

** Ispell
#+BEGIN_SRC emacs-lisp
  (use-package ispell
    :ensure t
    :config
    (setq ispell-program-name "aspell")
    (setq ispell-dictionary "english")
    (global-set-key (kbd "C-<f8>")
		       'flyspell-check-previous-highlighted-word))
#+END_SRC

* All org related
** Org package
#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :defer t
    :hook (org-mode . olivetti-mode)
    :config
    ;; Start up any org file with pretty latex images
    (setq org-startup-with-latex-preview t)
    (plist-put org-format-latex-options :scale 1.5)

    ;; All images showing
    (setq org-startup-with-inline-images t)

    ;; Org tempo templates
    (require 'org-tempo)
    (setq org-structure-template-alist
	  '(("el" . "src emacs-lisp")
	    ("sh" . "src shell")
	    ("py" . "src python :results output :exports both")
	    ("pys" . 
	    "src python :session :results output :exports both")
	    ("c" . "src C")
	    ("cl" . "src lisp")
	    ("hs" . "src haskell :results value :exports both")
	    ("js" . "src js :results output")
	    ))

    ;; Babel and the polyglot configuration
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (shell      . t)
       (python     . t)
       (C          . t)
       (haskell    . t)
       (js         . t)))
    )
#+end_src

** Org agenda
#+begin_src emacs-lisp
  (use-package org-agenda
    :ensure nil
    :config
    (global-set-key (kbd "C-c a") 'org-agenda)
    (custom-set-variables
     '(org-directory "~/Org/agenda")
     '(org-agenda-files (list org-directory))))
#+end_src

** Org appear
#+begin_src emacs-lisp
  (use-package org-appear
    :commands (org-appear-mode)
    :hook     (org-mode . org-appear-mode)
    :config
    ; Must be activated for org-appear to work
    (setq org-hide-emphasis-markers t)
    ; Show bold, italics, verbatim, etc.
    (setq org-appear-autoemphasis   t
	  ; Show links
	  org-appear-autolinks      t
	  ; Show sub- and superscripts
	  org-appear-autosubmarkers t))
#+end_src

** Org appear for latex
   #+begin_src emacs-lisp
     (use-package org-fragtog
       :after org
       :hook (org-mode . org-fragtog-mode))
   #+end_src

** Org Bullets
Org mode by default does not necessarily look ugly, but I do prefer
to use other bullet icons.
   #+begin_src emacs-lisp
     (use-package org-bullets
       :ensure t
       :init
       (setq org-bullets-bullet-list
	     '("ꖜ" "•" "❉" "⨿" "ᖷ"))
       (setq org-todo-keywords 
	     '((sequence "☛ TODO(t)" "➤ NEXT(n)" "|" "✔ DONE(d)")
	       (sequence "∞ WAITING(w)" "|"  "✘ CANCELED(c)")
	       (sequence "∞ READING(r)"
			 "∞ VIEWING(v)"
			 "𝅘𝅥𝅮 LISTENING(l)"
			 "░ WATCHLIST(a)"
			 "|"  "◤ FINISHED(f)")))
       (setq org-todo-keyword-faces
	     '(("✔ DONE" . (:foreground "gray"))))

       :config
       (add-hook 'org-mode-hook
		 (lambda () (org-bullets-mode 1)))
       (setq org-ellipsis "▼"))
   #+end_src

** Pomodoro
I do enjoy the whole habit of doing pomodoros. It helps me maintain 
some focus while working.
   #+begin_src emacs-lisp
     (use-package org-pomodoro
       :ensure t
       :commands (org-pomodoro)
       :config
       (setq org-pomodoro-play-sounds nil)
       (setq alert-user-configuration (quote
				       ((((:category . "org-pomodoro"))
					 libnotify nil)))))
   #+end_src

** Org reveal
doing presentations with org and reveal.js
#+begin_src emacs-lisp
  (use-package ox-reveal
    :ensure ox-reveal
    :config
    (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
    (setq org-reveal-mathjax t))
#+end_src

