init.el

(use-package dired-subtree
  :ensure t
  :config
  (setq dired-subtree-use-backgrounds nil)
  (define-key dired-mode-map [tab] 'dired-subtree-toggle))

(use-package vertico
  :config
  (vertico-mode 1)
	; Show more candidates
  (setq vertico-count                         25
	read-extended-command-predicate
	'command-completion-default-include-p
	; Ignore case of file names
	read-file-name-completion-ignore-case t
	; Ignore case in buffer completion
	read-buffer-completion-ignore-case    t
	; Ignore case in completion
	completion-ignore-case                t))

(use-package vertico-posframe
  :config
  (vertico-posframe-mode 1)
  (setq vertico-posframe-width  90
	vertico-posframe-height vertico-count))

(use-package corfu
  :custom
  ;; Enable auto completion
  (corfu-auto t)
  ;; Enable cycling for `corfu-next/previous'
  (corfu-cycle t)
  ;; No delay
  (corfu-auto-delay 0)
  ;; Start when this many characters have been typed
  (corfu-auto-prefix 2)
  ;; Short delay
  (corfu-popupinfo-delay 0.5)
   ;; Preselect the prompt
  (corfu-preselect 'prompt)
  :init
  (global-corfu-mode))

(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  ;; (setq completion-cycle-threshold 3)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete)

  ;; Emacs 30 and newer: Disable Ispell completion
  ;; function. As an alternative,
  ;; try `cape-dict'.
  (setq text-mode-ispell-word-completion nil)

  ;; Emacs 28 and newer: Hide commands in M-x
  ;; which do not apply to the current
  ;; mode.  Corfu commands are hidden, since
  ;; they are not used via M-x. This
  ;; setting is useful beyond Corfu.
  (setq read-extended-command-predicate
	#'command-completion-default-include-p))

(use-package which-key
  :ensure t
  :config (which-key-mode))

(use-package marginalia
  :init 
  (marginalia-mode 1))

(use-package helpful
  :bind (:map custom-bindings-map
			  ("C-h f" . #'helpful-function)
			  ("C-h v" . #'helpful-variable)
			  ("C-h k" . #'helpful-key)
			  ("C-h x" . #'helpful-command)
			  ("C-h d" . #'helpful-at-point)
			  ("C-h c" . #'helpful-callable)))

(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode 1))

(use-package yasnippet-snippets
  :ensure t)

(use-package haskell-snippets
  :defer t)

(use-package pdf-tools
  :ensure t
  :config
  (pdf-tools-install)
  :custom (pdf-annot-activate-created-annotations
	      t "automatically annotate highlights"))

(use-package lorem-ipsum)

;; Make sure that cmake, libtool, libtool-bin
(use-package vterm
    :ensure t)

(setq eshell-prompt-regexp "^[^αλ\n]*[αλ] ")
(setq eshell-prompt-function
      (lambda nil
	(concat
	 (if (string= (eshell/pwd) (getenv "HOME"))
	     (propertize "~" 'face `(:foreground "#99CCFF"))
	   (replace-regexp-in-string
	    (getenv "HOME")
	    (propertize "~" 'face `(:foreground "#99CCFF"))
	    (propertize (eshell/pwd) 'face
			`(:foreground "#99CCFF"))))
	 (if (= (user-uid) 0)
	     (propertize " α " 'face `(:foreground "#FF6666"))
	   (propertize " λ " 'face `(:foreground "#A6E22E"))))))

(setq eshell-highlight-prompt nil)

(defalias 'open 'find-file-other-window)
(defalias 'clean 'eshell/clear-scrollback)

(defun eshell-other-window ()
  "Create or visit an eshell buffer."
  (interactive)
  (if (not (get-buffer "*eshell*"))
      (progn
	(split-window-sensibly (selected-window))
	(other-window 1)
	(eshell))
    (switch-to-buffer-other-window "*eshell*")))

(global-set-key (kbd "<C-escape>") 'eshell-other-window)

(use-package magit
  :ensure t
  :bind (("C-c m" . magit-status)))

(use-package markdown-mode
  :defer t)

(use-package flyspell
  :ensure t
  :config
  (add-hook 'text-mode-hook 'flyspell-mode))

(use-package ispell
  :ensure t
  :config
  (setq ispell-program-name "aspell")
  (setq ispell-dictionary "english")
  (global-set-key (kbd "C-<f8>")
		     'flyspell-check-previous-highlighted-word))

(use-package org
  :ensure nil
  :defer t
  :hook (org-mode . olivetti-mode)
  :config
  ;; Start up any org file with pretty latex images
  (setq org-startup-with-latex-preview t)
  (plist-put org-format-latex-options :scale 1.5)

  ;; All images showing
  (setq org-startup-with-inline-images t)

  ;; Org tempo templates
  (require 'org-tempo)
  (setq org-structure-template-alist
	'(("el" . "src emacs-lisp")
	  ("sh" . "src shell")
	  ("py" . "src python :results output :exports both")
	  ("pys" . 
	  "src python :session :results output :exports both")
	  ("c" . "src C")
	  ("cl" . "src lisp")
	  ("hs" . "src haskell :results value :exports both")
	  ("js" . "src js :results output")
	  ))

  ;; Babel and the polyglot configuration
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell      . t)
     (python     . t)
     (C          . t)
     (haskell    . t)
     (js         . t)))
  )

(use-package org-agenda
  :ensure nil
  :config
  (global-set-key (kbd "C-c a") 'org-agenda)
  (custom-set-variables
   '(org-directory "~/Org/agenda")
   '(org-agenda-files (list org-directory))))

(use-package org-appear
  :commands (org-appear-mode)
  :hook     (org-mode . org-appear-mode)
  :config
  ; Must be activated for org-appear to work
  (setq org-hide-emphasis-markers t)
  ; Show bold, italics, verbatim, etc.
  (setq org-appear-autoemphasis   t
	; Show links
	org-appear-autolinks      t
	; Show sub- and superscripts
	org-appear-autosubmarkers t))

(use-package org-fragtog
  :after org
  :hook (org-mode . org-fragtog-mode))

(use-package org-bullets
  :ensure t
  :init
  (setq org-bullets-bullet-list
	'("ꖜ" "•" "❉" "⨿" "ᖷ"))
  (setq org-todo-keywords 
	'((sequence "☛ TODO(t)" "➤ NEXT(n)" "|" "✔ DONE(d)")
	  (sequence "∞ WAITING(w)" "|"  "✘ CANCELED(c)")
	  (sequence "∞ READING(r)"
		    "∞ VIEWING(v)"
		    "𝅘𝅥𝅮 LISTENING(l)"
		    "░ WATCHLIST(a)"
		    "|"  "◤ FINISHED(f)")))
  (setq org-todo-keyword-faces
	'(("✔ DONE" . (:foreground "gray"))))

  :config
  (add-hook 'org-mode-hook
	    (lambda () (org-bullets-mode 1)))
  (setq org-ellipsis "▼"))

(use-package org-pomodoro
  :ensure t
  :commands (org-pomodoro)
  :config
  (setq org-pomodoro-play-sounds nil)
  (setq alert-user-configuration (quote
				  ((((:category . "org-pomodoro"))
				    libnotify nil)))))

(use-package ox-reveal
  :ensure ox-reveal
  :config
  (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
  (setq org-reveal-mathjax t))

(use-package org-roam
  :ensure t
  :custom
