init.el
  (org-roam-directory (file-truename "~/Org/roam"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
	 ("C-c n f" . org-roam-node-find)
	 ("C-c n g" . org-roam-graph)
	 ("C-c n i" . org-roam-node-insert)
	 ("C-c n c" . org-roam-capture)
	 ;; Dailies
	 ("C-c n j" . org-roam-dailies-capture-today))
  :config
  ;; If you're using a vertical completion framework,
  ;; you might want a more informative completion interface
  (setq org-roam-node-display-template
	(concat "${title:*} "
		(propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  (require 'org-roam-protocol))

(use-package org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
	  org-roam-ui-follow t
	  org-roam-ui-update-on-save t
	  org-roam-ui-open-on-start t))

(use-package lsp-mode
  :ensure t
  :init
  (setq lsp-keymap-prefix "C-c l")
  :hook
  ((c-mode . lsp)
   (c++-mode . lsp)
   (web-mode . lsp)
   (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp
  :config
  (lsp-register-client
   (make-lsp-client
    :new-connection
    (lsp-tramp-connection "clangd")
    :major-modes '(c-mode c++-mode)
    :remote? t
    :server-id 'clangd-remote)))

(use-package lsp-ui
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-doc-enable nil)
  (setq lsp-ui-doc-header t)
  (setq lsp-ui-doc-include-signature t)
  (setq lsp-ui-doc-border (face-foreground 'default))
  (setq lsp-ui-sideline-show-code-actions t)
  (setq lsp-ui-sideline-delay 0.05))

(use-package lean4-mode
  :ensure lean4-mode
  :straight (lean4-mode
	     :type git
	     :host github
	     :repo "leanprover/lean4-mode"
	     :files ("*.el" "data"))
  :commands (lean4-mode))

(let ((my-ghcup-path (expand-file-name "~/.ghcup/bin")))
  (setenv "PATH" (concat my-ghcup-path ":" (getenv "PATH")))
  (add-to-list 'exec-path my-ghcup-path))

(use-package haskell-mode
  :defer t
  :hook (haskell-mode . haskell-doc-mode)
  :config
  (custom-set-variables
   '(haskell-tags-on-save t)
   '(haskell-process-suggest-remove-import-lines t)
   '(haskell-process-auto-import-loaded-modules t)
   '(haskell-process-log t)
   '(haskell-process-type 'stack-ghci)
     )

  (define-key haskell-mode-map (kbd "C-c C-l")
    'haskell-process-load-or-reload)
  )

(when (file-exists-p "~/.emacs.d/elisp/prolog.el")
  (load "~/.emacs.d/elisp/prolog.el")
  (setq prolog-electric-if-then-else-flag t))

(when (executable-find "swipl")
  (message "SWI-Prolog exists on path, using it!")
  (setq prolog-system 'swi
	prolog-program-switches
	'((swi ("-G128M" "-T128M" "-L128M" "-O"))
	  (t nil))))

(use-package ediprolog
  :ensure t
  :config
  ;; Scryer prolog is a pretty nice prolog system
  (when (executable-find "scryer-prolog")
    (setq ediprolog-system 'scryer)
    (setq ediprolog-program (executable-find "scryer-prolog")))
  (global-set-key [f10] 'ediprolog-dwim))

(when (file-exists-p "~/scryer-prolog/tools/showterm.el")
  (load "~/scryer-prolog/tools/showterm.el")
  (global-set-key [f12] 'showterm))

(use-package python
  :interpreter ("python3" . python-mode)
  :defer t
  :config
  (setq python-shell-interpreter "python3"))

(use-package pyvenv
  :defer t
  :config
  (setenv "WORKON_HOME" "~/py_home"))

(use-package ein
  :ensure t)

(use-package typescript-mode
  :ensure t
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred))

(use-package js2-mode
  :ensure t
  :mode (("\\.js\\'" . js2-mode)
	 ("\\.cjs\\'" . js2-mode))
  :hook (js2-mode . lsp-deferred))
(add-hook 'javascript-mode #'js2-mode)

(when
    (file-directory-p
     "~/.local/share/SuperCollider/downloaded-quarks/scel/el/")
  (add-to-list
   'load-path
   "~/.local/share/SuperCollider/downloaded-quarks/scel/el/")
  (require 'sclang))

(define-minor-mode custom-bindings-mode
  "A mode that activates custom keybindings."
  :init-value t
  :keymap custom-bindings-map)
